In [1]:
import pandas as pd

In [4]:
data = pd.read_csv('../datasets/titanic3.csv')

In [18]:
data.shape

(1310, 14)

In [15]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1310 entries, 0 to 1309
Data columns (total 14 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   pclass     1309 non-null   float64
 1   survived   1309 non-null   float64
 2   name       1309 non-null   object
 3   sex        1309 non-null   object
 4   age        1046 non-null   float64
 5   sibsp      1309 non-null   float64
 6   parch      1309 non-null   float64
 7   ticket     1309 non-null   object
 8   fare       1308 non-null   float64
 9   cabin      295 non-null    object
 10  embarked   1307 non-null   object
 11  boat       486 non-null    object
 12  body       121 non-null    float64
 13  home.dest  745 non-null    object
dtypes: float64(7), object(7)
memory usage: 143.4+ KB

In [20]:
data.columns

Index(['pclass', 'survived', 'name', 'sex', 'age', 'sibsp', 'parch', 'ticket',
       'fare', 'cabin', 'embarked', 'boat', 'body', 'home.dest'],
      dtype='object')

In [34]:
def dropMissingData(data_frame, column_name):
    data_frame_with_missing_data = data_frame[data_frame[column_name].isna()]
    indexes = data_frame_with_missing_data.index
    rows_to_drop = indexes.values
    data_frame2 = data_frame.drop(rows_to_drop)
    return data_frame2

In [35]:
data2 = dropMissingData(data, 'pclass')

In [36]:
data2.isna().sum()

pclass          0
survived        0
name            0
sex             0
age           263
sibsp           0
parch           0
ticket          0
fare            1
cabin        1014
embarked        2
boat          823
body         1188
home.dest     564
dtype: int64

In [39]:
data3 = data2.drop(columns=['body', 'cabin'])

In [41]:
data3[data3.fare.isna()]

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,embarked,boat,home.dest
1225,3.0,0.0,"Storey, Mr. Thomas",male,60.5,0.0,0.0,3701,NaN,S,NaN,NaN

In [60]:
data3['fare'] = data3['fare'].fillna(data3.fare.mean())

In [64]:
data3[data3.embarked.isna()]

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,embarked,boat,home.dest
168,1.0,1.0,"Icard, Miss. Amelie",female,38.0,0.0,0.0,113572,80.0,NaN,6,NaN
284,1.0,1.0,"Stone, Mrs. George Nelson (Martha Evelyn)",female,62.0,0.0,0.0,113572,80.0,NaN,6,"Cincinatti, OH"

In [71]:
data3.embarked.value_counts()

embarked
S    914
C    270
Q    123
Name: count, dtype: int64